Revit 2024 API
MEPNetworkSegmentData.ReynoldsNumber Property
 The Reynolds number of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double ReynoldsNumber { get; }
Visual Basic
Public ReadOnly Property ReynoldsNumber As Double
	Get
Visual C++
public:
property double ReynoldsNumber {
	double get ();
}
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace